"use strict";
cc._RF.push(module, '63ac8uKnc9BLqci/8PxtDw1', 'words');
// c2f-framework/game/words.ts

"use strict";
var _a;
Object.defineProperty(exports, "__esModule", { value: true });
exports.words = void 0;
/**
 * 1000以内为通用文本，后面以模块划分，每个模块预留1000
 */
exports.words = (_a = {},
    //通用
    _a[0] = "",
    _a[1] = "确定",
    _a[2] = "取消",
    _a[3] = "通用",
    _a[4] = "提示信息",
    _a[5] = "账号存在问题，请联系管理人员",
    _a[6] = "返回",
    _a[7] = "点击空白处关闭",
    _a[8] = "{0}小时",
    _a[9] = "继续",
    _a[10] = "退出",
    _a[11] = "提示",
    _a[12] = "保存",
    _a[13] = "正在进入游戏...",
    _a[20] = "K",
    _a[21] = "M",
    _a[22] = "B",
    _a[23] = "万",
    _a[24] = "亿",
    _a[25] = "兆",
    _a[26] = "消灭星星",
    _a[27] = "Settings",
    _a[509] = "您的网络已断开，点击确定重新登录游戏",
    _a[510] = "您的网络不太稳定，点击确定重新连接游戏",
    _a[511] = "重新连接成功",
    _a[512] = '登录超时，请重新登录',
    _a[513] = "连接成功",
    _a[1000] = "2048",
    _a[1006] = "连接服务器失败，请检查网络",
    _a[2000] = "篮球大战",
    _a[3000] = " {0} ",
    _a[3001] = "天",
    _a);

cc._RF.pop();