/**
 * 1000以内为通用文本，后面以模块划分，每个模块预留1000
 */
export const words = {
    //通用
    [0]: "",
    [1]: "确定",
    [2]: "取消",
    [3]: "通用",
    [4]: "提示信息",
    [5]: "账号存在问题，请联系管理人员",
    [6]: "返回",
    [7]: "点击空白处关闭",
    [8]: "{0}小时",
    [9]: "继续",
    [10]: "退出",
    [11]: "提示",
    [12]: "保存",
    [13]: "正在进入游戏...",
    [20]: "K",
    [21]: "M",
    [22]: "B",
    [23]: "万",
    [24]: "亿",
    [25]: "兆",
    [26]: "消灭星星",
    [27]: "Settings",

    [509]: "您的网络已断开，点击确定重新登录游戏",
    [510]: "您的网络不太稳定，点击确定重新连接游戏",
    [511]: "重新连接成功",
    [512]: '登录超时，请重新登录',
    [513]: "连接成功",

    [1000]: "2048",
    [1006]: "连接服务器失败，请检查网络",
    [2000]: "篮球大战",

    [3000]: " {0} ",
    [3001]: "天",

    [6000]: "贪吃蛇",

}
