/**
 * 1000以内为通用文本，后面以模块划分，每个模块预留1000
 */
export const words = {
    //0 到1000 之间拿来做errorCode 报错提示
    [0]: "成功",
    [1]: "未知错误",
    [2]: "注册账号已存在",
    [3]: "注册名字不合法",
    [4]: "注册密码不合法",
    [5]: "登录密码错误",
    [6]: "登录账号不存在",
    [7]: "房间已满",
    [8]: "不存在该房间",
    [9]: "玩家已经准备过了",
    [10]: "没有可以开始游戏的房间",
    [11]: "游戏已经开始不允许退出房间",

    //通用
    [1000]: "",
    [1001]: "确定",
    [1002]: "取消",
    [1003]: "通用",
    [1004]: "提示信息",
    [1005]: "账号存在问题，请联系管理人员",
    [1006]: "返回",
    [1007]: "点击空白处关闭",
    [1008]: "{0}小时",
    [1009]: "继续",
    [1010]: "退出",
    [1011]: "提示",
    [1012]: "保存",
    [1013]: "正在进入游戏...",
    [1020]: "K",
    [1021]: "M",
    [1022]: "B",
    [1023]: "万",
    [1024]: "亿",
    [1025]: "兆",
    [1026]: "消灭星星",
    [1027]: "Settings",

    [1509]: "您的网络已断开，点击确定重新登录游戏",
    [1510]: "您的网络不太稳定，点击确定重新连接游戏",
    [1511]: "重新连接成功",
    [1512]: '登录超时，请重新登录',
    [1513]: "连接成功",
    [1514]: "登录异常",
    [1515]: "登录成功",
    [1516]: "注册成功",



    [1600]: "2048",
    [1606]: "连接服务器失败，请检查网络",
    [2000]: "篮球大战",

    [3000]: " {0} ",
    [3001]: "天",

    [6000]: "贪吃蛇",
    
    [7000]: "你画我猜",
    [7001]: "正在登录中...",
    [7002]: "请输出账号...",
    [7003]: "请输出密码...",
    [7004]: "请输出确认密码...",
    [7005]: "两次输入密码不同...",
    [7006]: "房间号:{0}",
    [7007]: "提示",
    [7008]: "你画:{0}",
    [7009]: "提示:{0}",
    [7010]: "答错了",
    [7011]: "答对+{0}",
    [7012]: "答案:{0}",
    [7013]: "游戏结束...",

}
